{
  "classifier": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "Analyze the news article and classify it as a merger or acquisition deal.\n- A merger is when two companies combine to form a new entity.\n- An acquisition is when one company takes over another.\n- If it mentions a potential, rumored or failed deal, classify it as \"Other\".",
      "fields": [
        {
          "prefix": "Text:",
          "description": "${text}"
        },
        {
          "prefix": "Article Type:",
          "description": "${article_type}"
        }
      ]
    },
    "lm": null
  },
  "merger_extractor": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "You are given a news article text describing a merger deal between two companies. Your task is to extract structured information about the merger, focusing on the following fields:\n\n- article_id: The unique identifier for the article (provided in the input context).\n- company_1: The full name of the first company involved in the merger, as mentioned in the article.\n- company_1_ticker: The stock ticker(s) for company_1, including the exchange prefix if present (e.g., 'TSXV:TGI'). If no ticker is mentioned, return None.\n- company_2: The full name of the second company involved in the merger, as mentioned in the article.\n- company_2_ticker: The stock ticker(s) for company_2, including the exchange prefix if present (e.g., 'TSXV:BML'). If no ticker is mentioned, return None.\n- merged_entity: The name of the new or continuing entity after the merger, as specified in the article. If the merged entity retains the name of one of the original companies, use that name.\n- deal_amount: The value of the merger deal, including both the numeric value and the magnitude (e.g., '2.8 billion', '540 million'). Do not omit the magnitude.\n- deal_currency: The three-letter currency code for the deal amount (e.g., 'USD', 'CAD', 'AUD'). If the currency symbol is '$', assume 'USD'. If the symbol is 'A$', use 'AUD'. If the symbol is 'C$', use 'CAD'.\n- article_type: Always set this to 'merger'.\n\nGuidelines:\n- Extract company names and tickers exactly as they appear in the article. If a ticker is given with an exchange prefix (e.g., 'TSXV:TGI'), include the prefix. If only the ticker symbol is given, include it as is.\n- For deal_amount, always include the magnitude (e.g., 'billion', 'million') as stated in the article. Do not return only the numeric value.\n- For deal_currency, map currency symbols to their respective codes as follows: '$' → 'USD', 'A$' → 'AUD', 'C$' → 'CAD'.\n- If any field is not mentioned in the article, return None for that field.\n- Output your answer as a single line in the following format:\n  article_id=<id> company_1='<company_1>' company_1_ticker=<company_1_ticker> company_2='<company_2>' company_2_ticker=<company_2_ticker> merged_entity='<merged_entity>' deal_amount='<deal_amount>' deal_currency='<deal_currency>' article_type='merger'\n- Ensure all string values are enclosed in single quotes, and list tickers as Python lists (e.g., ['TSXV:TGI']) or None.\n\nExample:\nIf the article says \"Tundra Gold Inc. (TSXV:TGI) and Boreal Mining Ltd. (TSXV:BML) have entered a definitive agreement to merge in a C$540 million all-stock transaction. The combined company, to be named Northern Tundra Resources...\", your output should be:\narticle_id=39 company_1='Tundra Gold Inc.' company_1_ticker=['TSXV:TGI'] company_2='Boreal Mining Ltd.' company_2_ticker=['TSXV:BML'] merged_entity='Northern Tundra Resources' deal_amount='540 million' deal_currency='CAD' article_type='merger'",
      "fields": [
        {
          "prefix": "Text:",
          "description": "${text}"
        },
        {
          "prefix": "Merger Info:",
          "description": "${merger_info}"
        }
      ]
    },
    "lm": null
  },
  "acquisition_extractor": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "Extract structured information about companies involved in an acquisition deal from a given news article text. \n\nFor each article, output the following fields:\n- article_id: The unique identifier for the article (provided in the input).\n- parent_company: The full, official name of the acquiring company.\n- parent_company_ticker: A list of all stock tickers for the acquiring company, including the exchange prefix if present (e.g., 'TSX:ZCC'). If no ticker is mentioned, return None.\n- child_company: The full, official name of the company being acquired.\n- child_company_ticker: A list of all stock tickers for the acquired company, including the exchange prefix if present. If no ticker is mentioned, return None.\n- deal_amount: The total value of the acquisition deal, including the unit (e.g., '1.4 billion'). If the amount is given in a different form (e.g., '1,400,000,000'), convert it to a human-readable format with the appropriate unit (million, billion, etc.).\n- deal_currency: The currency of the deal. If the currency symbol is just '$', assume 'USD'. Otherwise, use the currency explicitly mentioned or implied by the symbol (e.g., 'C$', '€', etc.).\n- article_type: Always set to 'acquisition' for this task.\n\nAdditional instructions:\n- Extract company names and tickers exactly as they appear in the text, including exchange prefixes (e.g., 'TSX:ZCC'), unless the ticker is not provided, in which case return None.\n- If multiple tickers are mentioned for a company, include all in a list.\n- For deal_amount, always include the unit (e.g., 'million', 'billion') as stated or implied in the text.\n- For deal_currency, follow the rule: if the symbol is '$' with no other context, assume 'USD'.\n- If any field is not present in the text, return None for that field.\n- Output the extracted information in a single line, with each field in the format: field_name=value, and string values in single quotes. For lists, use standard Python list syntax.\n\nExample output:\narticle_id=38 parent_company='Zenith Copper Corp.' parent_company_ticker=['TSX:ZCC'] child_company='Andean Metals S.A.' child_company_ticker=None deal_amount='1.4 billion' deal_currency='USD' article_type='acquisition'",
      "fields": [
        {
          "prefix": "Text:",
          "description": "${text}"
        },
        {
          "prefix": "Acquisition Info:",
          "description": "${acquisition_info}"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.4b1",
      "cloudpickle": "3.1"
    }
  }
}
